/*
Задача 8*. Напишете програма, която пресмята колко символа има в един
низ преди края на низа, обозначен със символа ‘\0’. Как трябва да изглежда
програмата:
*/

#include <stdio.h>


int main() {

    char s[] = "Hello CodeAcademy";

    int i = 0;

    for(i = 0; s[i] != '\0'; i++) {

        printf("%c", s[i]);

    }

    return 0;
}
